IDEA StatiCa Open Model
NadSetupValueInt Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Setup value int
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.NadSetupValue
 IdeaRS.OpenModel.Concrete.NadSetupValueInt
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class NadSetupValueInt : NadSetupValue
Public Class NadSetupValueInt
	Inherits NadSetupValue
public ref class NadSetupValueInt : public NadSetupValue
The NadSetupValueInt type exposes the following members.
Constructors
Name | Description
NadSetupValueInt
Initializes a new instance of the NadSetupValueInt class
Top
Properties
Name | Description
Id
 Gets or sets the value id.
 (Inherited from NadSetupValue.)
IsActive
 Is active
 (Inherited from NadSetupValue.)
Value
 Gets or sets the value.
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace